---
kind: property
id: P:Autodesk.Revit.DB.Architecture.CutMarkType.CutMarkSymbol
source: html/35be728c-3f7a-95e0-495c-0fa9c345f75d.htm
---
# Autodesk.Revit.DB.Architecture.CutMarkType.CutMarkSymbol Property

The symbol type of the cut mark.

## Syntax (C#)
```csharp
public CutMarkSymbol CutMarkSymbol { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration